/** Напишите программу, которая просит пользователя ввести целое число.
Если пользователь вводит что-то другое, отлавливайте исключение и выводите
сообщение об ошибке. Блок finally должен выводить сообщение “Конец программы”. **/

fun main() {
    println("Введите целое число: ")
    var input1 = readln()
    try {
        var a = input1.toInt()
    } catch (e: NumberFormatException) {
        println("Исключение поймано: $e")
    } finally {
        println("Конец программы!")
    }

    /** Создайте ситуацию, где может возникнуть исключение (например,
    обращение к несуществующему элементу массива или деление на ноль),
    и обработайте это исключение, выводя стек вызовов. **/

    var arr = IntArray(5) {(0..100).random() }
    var k = 0
    var i = 0
    while (i <= 5) {
        i++
        try {
            k = arr[i]*2
        } catch (e: IndexOutOfBoundsException) {
            println("Исключение поймано: $e")
        }
    }


}